adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcess.cpp
    return IPC::Message::IPDLMessage(routingId, Reply_GetHttpConnectionData__ID, IPC::Message::HeaderFlags(IPC::Message::NOT_NESTED, IPC::Message::NORMAL_PRIORITY, IPC::Message::COMPRESSION_NONE, IPC::Message::NOT_CONSTRUCTOR, IPC::Message::ASYNC, IPC::Message::NOT_INTERRUPT, IPC::Message::REPLY));
}
IPC::Message*
Msg_PFileDescriptorSetConstructor(int32_t routingId)
{
    return IPC::Message::IPDLMessage(routingId, Msg_PFileDescriptorSetConstructor__ID, IPC::Message::HeaderFlags(IPC::Message::NOT_NESTED, IPC::Message::NORMAL_PRIORITY, IPC::Message::COMPRESSION_NONE, IPC::Message::CONSTRUCTOR, IPC::Message::ASYNC, IPC::Message::NOT_INTERRUPT, IPC::Message::NOT_REPLY));
}
IPC::Message*
Reply_PFileDescriptorSetConstructor(int32_t routingId)
{
    return IPC::Message::IPDLMessage(routingId, Reply_PFileDescriptorSetConstructor__ID, IPC::Message::HeaderFlags(IPC::Message::NOT_NESTED, IPC::Message::NORMAL_PRIORITY, IPC::Message::COMPRESSION_NONE, IPC::Message::CONSTRUCTOR, IPC::Message::ASYNC, IPC::Message::NOT_INTERRUPT, IPC::Message::REPLY));
}
IPC::Message*
Msg_PDNSRequestConstructor(int32_t routingId)
{
    return IPC::Message::IPDLMessage(routingId, Msg_PDNSRequestConstructor__ID, IPC::Message::HeaderFlags(IPC::Message::NOT_NESTED, IPC::Message::NORMAL_PRIORITY, IPC::Message::COMPRESSION_NONE, IPC::Message::CONSTRUCTOR, IPC::Message::ASYNC, IPC::Message::NOT_INTERRUPT, IPC::Message::NOT_REPLY));
}
IPC::Message*
Reply_PDNSRequestConstructor(int32_t routingId)
{
    return IPC::Message::IPDLMessage(routingId, Reply_PDNSRequestConstructor__ID, IPC::Message::HeaderFlags(IPC::Message::NOT_NESTED, IPC::Message::NORMAL_PRIORITY, IPC::Message::COMPRESSION_NONE, IPC::Message::CONSTRUCTOR, IPC::Message::ASYNC, IPC::Message::NOT_INTERRUPT, IPC::Message::REPLY));
}

} // namespace PSocketProcess
} // namespace net
} // namespace mozilla

//-----------------------------------------------------------------------------
// Method definitions for the IPDL type |struct HttpHandlerInitArgs|
//
namespace mozilla {
namespace net {
} // namespace net
} // namespace mozilla

namespace mozilla {
namespace ipc {
auto IPDLParamTraits<mozilla::net::HttpHandlerInitArgs>::Write(
        IPC::Message* aMsg,
        mozilla::ipc::IProtocol* aActor,
        const paramType& aVar) -> void
{
    WriteIPDLParam(aMsg, aActor, (aVar).mLegacyAppName());
    // Sentinel = 'mLegacyAppName'
    (aMsg)->WriteSentinel(675743077);
    WriteIPDLParam(aMsg, aActor, (aVar).mLegacyAppVersion());
    // Sentinel = 'mLegacyAppVersion'
    (aMsg)->WriteSentinel(1000212170);
    WriteIPDLParam(aMsg, aActor, (aVar).mPlatform());
    // Sentinel = 'mPlatform'
    (aMsg)->WriteSentinel(303170483);
    WriteIPDLParam(aMsg, aActor, (aVar).mOscpu());
    // Sentinel = 'mOscpu'
    (aMsg)->WriteSentinel(141099640);
    WriteIPDLParam(aMsg, aActor, (aVar).mMisc());
    // Sentinel = 'mMisc'
    (aMsg)->WriteSentinel(98435578);
    WriteIPDLParam(aMsg, aActor, (aVar).mProduct());
    // Sentinel = 'mProduct'
    (aMsg)->WriteSentinel(245367631);
    WriteIPDLParam(aMsg, aActor, (aVar).mProductSub());
    // Sentinel = 'mProductSub'
    (aMsg)->WriteSentinel(449971321);
    WriteIPDLParam(aMsg, aActor, (aVar).mAppName());
    // Sentinel = 'mAppName'
    (aMsg)->WriteSentinel(228655888);
    WriteIPDLParam(aMsg, aActor, (aVar).mAppVersion());
    // Sentinel = 'mAppVersion'
    (aMsg)->WriteSentinel(435750005);
    WriteIPDLParam(aMsg, aActor, (aVar).mCompatFirefox());
    // Sentinel = 'mCompatFirefox'
    (aMsg)->WriteSentinel(695010725);
    WriteIPDLParam(aMsg, aActor, (aVar).mCompatDevice());
    // Sentinel = 'mCompatDevice'
    (aMsg)->WriteSentinel(599000354);
    WriteIPDLParam(aMsg, aActor, (aVar).mDeviceModelId());
    // Sentinel = 'mDeviceModelId'
    (aMsg)->WriteSentinel(679085404);
}

auto IPDLParamTraits<mozilla::net::HttpHandlerInitArgs>::Read(
        const IPC::Message* aMsg,
        PickleIterator* aIter,
        mozilla::ipc::IProtocol* aActor,
        paramType* aVar) -> bool
{
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mLegacyAppName())))))) {
        aActor->FatalError("Error deserializing 'mLegacyAppName' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    // Sentinel = 'mLegacyAppName'
    if ((!((aMsg)->ReadSentinel(aIter, 675743077)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mLegacyAppName' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mLegacyAppVersion())))))) {
        aActor->FatalError("Error deserializing 'mLegacyAppVersion' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    // Sentinel = 'mLegacyAppVersion'
    if ((!((aMsg)->ReadSentinel(aIter, 1000212170)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mLegacyAppVersion' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mPlatform())))))) {
        aActor->FatalError("Error deserializing 'mPlatform' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    // Sentinel = 'mPlatform'
    if ((!((aMsg)->ReadSentinel(aIter, 303170483)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mPlatform' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mOscpu())))))) {
        aActor->FatalError("Error deserializing 'mOscpu' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    // Sentinel = 'mOscpu'
    if ((!((aMsg)->ReadSentinel(aIter, 141099640)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mOscpu' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mMisc())))))) {
        aActor->FatalError("Error deserializing 'mMisc' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    // Sentinel = 'mMisc'
    if ((!((aMsg)->ReadSentinel(aIter, 98435578)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mMisc' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mProduct())))))) {
        aActor->FatalError("Error deserializing 'mProduct' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    // Sentinel = 'mProduct'
    if ((!((aMsg)->ReadSentinel(aIter, 245367631)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mProduct' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mProductSub())))))) {
        aActor->FatalError("Error deserializing 'mProductSub' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    // Sentinel = 'mProductSub'
    if ((!((aMsg)->ReadSentinel(aIter, 449971321)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mProductSub' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mAppName())))))) {
        aActor->FatalError("Error deserializing 'mAppName' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    // Sentinel = 'mAppName'
    if ((!((aMsg)->ReadSentinel(aIter, 228655888)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mAppName' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mAppVersion())))))) {
        aActor->FatalError("Error deserializing 'mAppVersion' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    // Sentinel = 'mAppVersion'
    if ((!((aMsg)->ReadSentinel(aIter, 435750005)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mAppVersion' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mCompatFirefox())))))) {
        aActor->FatalError("Error deserializing 'mCompatFirefox' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    // Sentinel = 'mCompatFirefox'
    if ((!((aMsg)->ReadSentinel(aIter, 695010725)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mCompatFirefox' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mCompatDevice())))))) {
        aActor->FatalError("Error deserializing 'mCompatDevice' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    // Sentinel = 'mCompatDevice'
    if ((!((aMsg)->ReadSentinel(aIter, 599000354)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mCompatDevice' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mDeviceModelId())))))) {
        aActor->FatalError("Error deserializing 'mDeviceModelId' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    // Sentinel = 'mDeviceModelId'
    if ((!((aMsg)->ReadSentinel(aIter, 679085404)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mDeviceModelId' (nsCString) member of 'HttpHandlerInitArgs'");
        return false;
    }
    return true;
}

} // namespace ipc
} // namespace mozilla

