adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcess.cpp
//-----------------------------------------------------------------------------
// Method definitions for the IPDL type |struct SocketDataArgs|
//
namespace mozilla {
namespace net {
auto SocketDataArgs::StaticAssertions() const -> void
{
    static_assert(
        (offsetof(SocketDataArgs, totalRecv_) - offsetof(SocketDataArgs, totalSent_)) == 8,
        "Bad assumptions about field layout!");
}

} // namespace net
} // namespace mozilla

namespace mozilla {
namespace ipc {
auto IPDLParamTraits<mozilla::net::SocketDataArgs>::Write(
        IPC::Message* aMsg,
        mozilla::ipc::IProtocol* aActor,
        const paramType& aVar) -> void
{
    WriteIPDLParam(aMsg, aActor, (aVar).info());
    // Sentinel = 'info'
    (aMsg)->WriteSentinel(70058413);
    (aMsg)->WriteBytes((&((aVar).totalSent())), 16);
    // Sentinel = 'totalSent | totalRecv'
    (aMsg)->WriteSentinel(1522731055);
}

auto IPDLParamTraits<mozilla::net::SocketDataArgs>::Read(
        const IPC::Message* aMsg,
        PickleIterator* aIter,
        mozilla::ipc::IProtocol* aActor,
        paramType* aVar) -> bool
{
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->info())))))) {
        aActor->FatalError("Error deserializing 'info' (SocketInfo[]) member of 'SocketDataArgs'");
        return false;
    }
    // Sentinel = 'info'
    if ((!((aMsg)->ReadSentinel(aIter, 70058413)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'info' (SocketInfo[]) member of 'SocketDataArgs'");
        return false;
    }
    if ((!((aMsg)->ReadBytesInto(aIter, (&((aVar)->totalSent())), 16)))) {
        aActor->FatalError("Error bulk reading fields from uint64_t");
        return false;
    }
    // Sentinel = 'totalSent | totalRecv'
    if ((!((aMsg)->ReadSentinel(aIter, 1522731055)))) {
        mozilla::ipc::SentinelReadError("Error bulk reading fields from uint64_t");
        return false;
    }
    return true;
}

} // namespace ipc
} // namespace mozilla

//-----------------------------------------------------------------------------
// Method definitions for the IPDL type |struct SocketPorcessInitAttributes|
//
namespace mozilla {
namespace net {
} // namespace net
} // namespace mozilla

namespace mozilla {
namespace ipc {
auto IPDLParamTraits<mozilla::net::SocketPorcessInitAttributes>::Write(
        IPC::Message* aMsg,
        mozilla::ipc::IProtocol* aActor,
        const paramType& aVar) -> void
{
    WriteIPDLParam(aMsg, aActor, (aVar).mOffline());
    // Sentinel = 'mOffline'
    (aMsg)->WriteSentinel(237437745);
    WriteIPDLParam(aMsg, aActor, (aVar).mConnectivity());
    // Sentinel = 'mConnectivity'
    (aMsg)->WriteSentinel(616498541);
    WriteIPDLParam(aMsg, aActor, (aVar).mInitSandbox());
    // Sentinel = 'mInitSandbox'
    (aMsg)->WriteSentinel(514131153);
    WriteIPDLParam(aMsg, aActor, (aVar).mSandboxBroker());
    // Sentinel = 'mSandboxBroker'
    (aMsg)->WriteSentinel(697959842);
}

auto IPDLParamTraits<mozilla::net::SocketPorcessInitAttributes>::Read(
        const IPC::Message* aMsg,
        PickleIterator* aIter,
        mozilla::ipc::IProtocol* aActor,
        paramType* aVar) -> bool
{
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mOffline())))))) {
        aActor->FatalError("Error deserializing 'mOffline' (bool) member of 'SocketPorcessInitAttributes'");
        return false;
    }
    // Sentinel = 'mOffline'
    if ((!((aMsg)->ReadSentinel(aIter, 237437745)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mOffline' (bool) member of 'SocketPorcessInitAttributes'");
        return false;
    }
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mConnectivity())))))) {
        aActor->FatalError("Error deserializing 'mConnectivity' (bool) member of 'SocketPorcessInitAttributes'");
        return false;
    }
    // Sentinel = 'mConnectivity'
    if ((!((aMsg)->ReadSentinel(aIter, 616498541)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mConnectivity' (bool) member of 'SocketPorcessInitAttributes'");
        return false;
    }
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mInitSandbox())))))) {
        aActor->FatalError("Error deserializing 'mInitSandbox' (bool) member of 'SocketPorcessInitAttributes'");
        return false;
    }
    // Sentinel = 'mInitSandbox'
    if ((!((aMsg)->ReadSentinel(aIter, 514131153)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mInitSandbox' (bool) member of 'SocketPorcessInitAttributes'");
        return false;
    }
    if ((!(ReadIPDLParam(aMsg, aIter, aActor, (&((aVar)->mSandboxBroker())))))) {
        aActor->FatalError("Error deserializing 'mSandboxBroker' (FileDescriptor?) member of 'SocketPorcessInitAttributes'");
        return false;
    }
    // Sentinel = 'mSandboxBroker'
    if ((!((aMsg)->ReadSentinel(aIter, 697959842)))) {
        mozilla::ipc::SentinelReadError("Error deserializing 'mSandboxBroker' (FileDescriptor?) member of 'SocketPorcessInitAttributes'");
        return false;
    }
    return true;
}

} // namespace ipc
} // namespace mozilla
